; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared0 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	Star4 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument2 infrared0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Phenomenon12)
	(have_image Phenomenon7 thermograph2)
	(have_image Phenomenon8 infrared1)
	(have_image Star9 infrared0)
	(have_image Star10 infrared0)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 infrared0)
	(have_image Planet13 infrared0)
	(have_image Star14 infrared1)
	(have_image Star15 infrared1)
	(have_image Phenomenon16 thermograph2)
))

)

; plan
1. (turn_to satellite1 star4 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star4)
   goals met: 0 of 12
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 planet13 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet13)
   goals met: 0 of 12
5. (take_image satellite1 planet13 instrument2 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon8 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 12
7. (turn_to satellite0 groundstation6 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 12
8. (take_image satellite1 phenomenon8 instrument2 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 2 of 12
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 12
10. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 2 of 12
11. (turn_to satellite0 phenomenon16 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 12
12. (take_image satellite0 phenomenon16 instrument1 thermograph2)
   added: (have_image phenomenon16 thermograph2)
   goals met: 3 of 12
13. (turn_to satellite0 phenomenon7 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 12
14. (take_image satellite0 phenomenon7 instrument1 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 4 of 12
15. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 4 of 12
16. (take_image satellite0 planet11 instrument1 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 5 of 12
17. (turn_to satellite0 groundstation0 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation0)
   goals met: 6 of 12
18. (turn_to satellite1 star10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star10)
   goals met: 6 of 12
19. (take_image satellite1 star10 instrument2 infrared0)
   added: (have_image star10 infrared0)
   goals met: 7 of 12
20. (turn_to satellite1 star14 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star14)
   goals met: 7 of 12
21. (take_image satellite1 star14 instrument2 infrared1)
   added: (have_image star14 infrared1)
   goals met: 8 of 12
22. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 8 of 12
23. (take_image satellite1 star15 instrument2 infrared1)
   added: (have_image star15 infrared1)
   goals met: 9 of 12
24. (turn_to satellite1 star9 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star9)
   goals met: 9 of 12
25. (take_image satellite1 star9 instrument2 infrared0)
   added: (have_image star9 infrared0)
   goals met: 10 of 12
26. (turn_to satellite1 phenomenon12 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon12)
   goals met: 11 of 12
27. (take_image satellite1 phenomenon12 instrument2 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 12 of 12
